backend/controllers/EventController.php

SELECT * FROM `event` WHERE `id`='11'
---
    protected function findModel($id)
    {
        if (($model = Event::findOne($id)) !== null) {