backend/controllers/SiteController.php

    public function actionIndex()
    {
        $event = Event::find()->all();
---
SELECT * FROM `event`