backend/controllers/StatisticsController.php

    public function actionBrowsers(){

        $query = (new \yii\db\Query())->from('statistics')->where(['brauzer'=>'Chrome']);
        $chrome = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['brauzer'=>'Firefox']);
        $firefox = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['brauzer'=>'Opera']);
        $opera = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['brauzer'=>'Internet Explorer']);
        $ie = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['brauzer'=>'Safari']);
        $safari = $query->sum('count');
---
SELECT SUM(count) FROM `statistics` WHERE `brauzer`='Chrome'
SELECT SUM(count) FROM `statistics` WHERE `brauzer`='Firefox'
SELECT SUM(count) FROM `statistics` WHERE `brauzer`='Opera'
SELECT SUM(count) FROM `statistics` WHERE `brauzer`='Internet Explorer'
SELECT SUM(count) FROM `statistics` WHERE `brauzer`='Safari'

    public function actionMonth(){



        for($i=1;$i<=$this->day;$i++){
            $query = (new \yii\db\Query())->from('statistics')->where(['DAY (date)'=> $i])->andWhere(['MONTH (date)' => $this->month]);
            $model[] = $query->sum('count');
---
SELECT SUM(count) FROM `statistics` WHERE (DAY (date)=1) AND (MONTH (date)='7')

    public function actionPlatforms(){

        $query = (new \yii\db\Query())->from('statistics')->where(['platform'=>'iPhone']);
        $result['iPhone'] = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['platform'=>'iPad']);
        $result['iPad'] = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['platform'=>'Android']);
        $result['Android'] = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['platform'=>'webOS']);
        $result['webOS'] = $query->sum('count');

        $query = (new \yii\db\Query())->from('statistics')->where(['platform'=>'Windows']);
        $result['Windows'] = $query->sum('count');
---
SELECT SUM(count) FROM `statistics` WHERE `platform`='iPhone'
SELECT SUM(count) FROM `statistics` WHERE `platform`='iPad'
SELECT SUM(count) FROM `statistics` WHERE `platform`='Android'
SELECT SUM(count) FROM `statistics` WHERE `platform`='webOS'
SELECT SUM(count) FROM `statistics` WHERE `platform`='Windows'

    public function actionCountries(){
        $query = (new \yii\db\Query())->select(['country'])->from('statistics')->Where(['MONTH (date)' => $this->month]);
        $query =  $query->all();
---
SELECT `country` FROM `statistics` WHERE MONTH (date)='7'