backend/posts/models/CategoryTree.php

    public function asd(){
        $res = $this->find()->all();
---
SELECT * FROM `categories`