backend/posts/views/categories/_create.php

SELECT * FROM `lang`
---
use yii\helpers\Url;
use kartik\file\FileInput;

$lang = Lang::find()->all();

SELECT * FROM `categories` WHERE `lang`='am' GROUP BY `forlang_id`
---

        <?= $form->field($model, 'title')->textInput(['maxlength' => true]) ?>
        <?= $form->field($model, 'slug')->textInput(['maxlength' => true]) ?>
        <?php echo $form->field($model, 'paret_id')->dropDownList(ArrayHelper::map(Categories::find()->where(['lang' => 'am'])->groupBy('forlang_id')->all(),'id','title'), ['prompt'=>'Choose...']);?>