backend/posts/views/categories/_form.php

SELECT * FROM `lang`
---
use yii\helpers\Url;
use kartik\file\FileInput;

$lang = Lang::find()->all();

SELECT * FROM `categories`
---
                    <div class="box-body cat-box no-padding " style="display: block;">
                        <?= $form->field($model, 'title')->textInput(['maxlength' => true]) ?>
                        <?= $form->field($model, 'slug')->textInput(['maxlength' => true]) ?>
                        <?php  $model->title = 'new'; echo $form->field($model, 'paret_id')->dropDownList(ArrayHelper::map(Categories::find()->all(),'id','title'), ['prompt'=>'Choose...']);?>