backend/views/site/index.php

SELECT COUNT(*) FROM `statistics` ORDER BY `id`
---
use backend\models\Emails;
use yii\widgets\ActiveForm;
use yii\helpers\Html;
$uniq = Statistics::find()->orderBy('id')->count();