backend/posts/views/posts/_form.php

/* @var $this yii\web\View */
/* @var $model backend\posts\models\Posts */
/* @var $form yii\widgets\ActiveForm */
$langs = Lang::find()->all();
---
SELECT * FROM `lang`