backend/models/Emails.php

    public function getNotRead(){
        $model = $this->find()
                    ->where(['is_new' => 0])
                    ->orderBy(['created_at'=> SORT_DESC])
                    ->all();
---
SELECT * FROM `emails` WHERE `is_new`=0 ORDER BY `created_at` DESC