backend/posts/controllers/CategoriesController.php

    public function init(){
        $this->lang = Lang::getCurrent()->url;
        $this->model = new Categories();
        $res = $this->model->find()->where(['lang' => 'am'])->groupBy('forlang_id')->all();
---
SELECT * FROM `categories` WHERE `lang`='am' GROUP BY `forlang_id`

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Categories::find(),
        ]);
---
SELECT * FROM `categories`

    protected function findModel($id)
    {
        if (($model = Categories::findOne($id)) !== null) {
---
SELECT * FROM `categories` WHERE `id`='6'